david-sawatzke/s32duino/s32duino/cores/arduino/stm32/PortNames.c
/*
*******************************************************************************
* Copyright (c) 2017, STMicroelectronics
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1. Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
* 2. Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
* 3. Neither the name of STMicroelectronics nor the names of its contributors
*    may be used to endorse or promote products derived from this software
*    without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
* FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
* DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
* CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
* OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
* OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*******************************************************************************
*/
#include "PortNames.h"
#include "stm32_def.h"

uint8_t getGPIOPortNumber(volatile GPIO_TypeDef *port_idx) {
	switch ((uint32_t) port_idx) {
	case GPIOA_BASE:
		return 0;
	case GPIOB_BASE:
		return 1;
#if defined GPIOC_BASE
	case GPIOC_BASE:
		return 2;
		break;
#endif
#if defined GPIOD_BASE
	case GPIOD_BASE:
		return 3;
		break;
#endif
#if defined GPIOE_BASE
#warning "GPIOE Clock Enable not implemented"
	case GPIOE_BASE:
		__HAL_RCC_GPIOE_CLK_ENABLE();
		break;
#endif
#if defined GPIOF_BASE
	case GPIOF_BASE:
		return 5;
#endif
#if defined GPIOG_BASE
#warning "GPIOG Clock Enable not implemented"
	case GPIOG_BASE:
		__HAL_RCC_GPIOG_CLK_ENABLE();
		break;
#endif
#if defined GPIOH_BASE
#warning "GPIOH Clock Enable not implemented"
	case GPIOH_BASE:
		__HAL_RCC_GPIOH_CLK_ENABLE();
		break;
#endif
#if defined GPIOI_BASE
#warning "GPIOI Clock Enable not implemented"
	case GPIOI_BASE:
		gpioPort = (GPIO_TypeDef *)GPIOI_BASE;
		__HAL_RCC_GPIOI_CLK_ENABLE();
		break;
#endif
	default:
		// wrong port number
		//TBD: error management
		return 255;
	}
}
